TexasInstruments/c2000ware-core-sdk/driverlib/f28002x/driverlib/clb.h
    CLB_GLOBAL_IN_MUX_EPWM3A            = 32,  //!< EPWM3A (CLB1)
    CLB_GLOBAL_IN_MUX_EPWM7A            = 32,  //!< EPWM7A (CLB2)
    CLB_GLOBAL_IN_MUX_EPWM3A_OE         = 33,  //!< EPWM3A trip output (CLB1)
    CLB_GLOBAL_IN_MUX_EPWM7A_OE         = 33,  //!< EPWM7A trip output (CLB2)
    CLB_GLOBAL_IN_MUX_EPWM3B            = 34,  //!< EPWM3B (CLB1)
    CLB_GLOBAL_IN_MUX_EPWM7B            = 34,  //!< EPWM7B (CLB2)
    CLB_GLOBAL_IN_MUX_EPWM3B_OE         = 35,  //!< EPWM3B trip output (CLB1)
    CLB_GLOBAL_IN_MUX_EPWM7B_OE         = 35,  //!< EPWM7B trip output (CLB2)
    CLB_GLOBAL_IN_MUX_EPWM3_CTR_ZERO    = 36,  //!< EPWM3 TBCTR = Zero (CLB1)
    CLB_GLOBAL_IN_MUX_EPWM7_CTR_ZERO    = 36,  //!< EPWM7 TBCTR = Zero (CLB2)
    CLB_GLOBAL_IN_MUX_EPWM3_CTR_PRD     = 37,  //!< EPWM3 TBCTR = TBPRD (CLB1)
    CLB_GLOBAL_IN_MUX_EPWM7_CTR_PRD     = 37,  //!< EPWM7 TBCTR = TBPRD (CLB2)
    CLB_GLOBAL_IN_MUX_EPWM3_CTRDIR      = 38,  //!< EPWM3 CTRDIR (CLB1)
    CLB_GLOBAL_IN_MUX_EPWM7_CTRDIR      = 38,  //!< EPWM7 CTRDIR (CLB2)
    CLB_GLOBAL_IN_MUX_EPWM3_TBCLK       = 39,  //!< EPWM3 TBCLK (CLB1)
    CLB_GLOBAL_IN_MUX_EPWM7_TBCLK       = 39,  //!< EPWM7 TBCLK (CLB2)
    CLB_GLOBAL_IN_MUX_EPWM3_CTR_CMPA    = 40,  //!< EPWM3 TBCTR = CMPA (CLB1)
    CLB_GLOBAL_IN_MUX_EPWM7_CTR_CMPA    = 40,  //!< EPWM7 TBCTR = CMPA (CLB2)
    CLB_GLOBAL_IN_MUX_EPWM3_CTR_CMPB    = 41,  //!< EPWM3 TBCTR = CMPB (CLB1)
    CLB_GLOBAL_IN_MUX_EPWM7_CTR_CMPB    = 41,  //!< EPWM7 TBCTR = CMPB (CLB2)
    CLB_GLOBAL_IN_MUX_EPWM3_CTR_CMPC    = 42,  //!< EPWM3 TBCTR = CMPC (CLB1)
    CLB_GLOBAL_IN_MUX_EPWM7_CTR_CMPC    = 42,  //!< EPWM7 TBCTR = CMPC (CLB2)
    CLB_GLOBAL_IN_MUX_EPWM3_CTR_CMPD    = 43,  //!< EPWM3 TBCTR = CMPD (CLB1)
    CLB_GLOBAL_IN_MUX_EPWM7_CTR_CMPD    = 43,  //!< EPWM7 TBCTR = CMPD (CLB2)
    CLB_GLOBAL_IN_MUX_EPWM3A_AQ         = 44,  //!< EPWM3A AQ submodule output (CLB1)
    CLB_GLOBAL_IN_MUX_EPWM7A_AQ         = 44,  //!< EPWM7A AQ submodule output (CLB2)
    CLB_GLOBAL_IN_MUX_EPWM3B_AQ         = 45,  //!< EPWM3B AQ submodule output (CLB1)
    CLB_GLOBAL_IN_MUX_EPWM7B_AQ         = 45,  //!< EPWM7B AQ submodule output (CLB2)
    CLB_GLOBAL_IN_MUX_EPWM3A_DB         = 46,  //!< EPWM3A DB submodule output (CLB1)
    CLB_GLOBAL_IN_MUX_EPWM7A_DB         = 46,  //!< EPWM7A DB submodule output (CLB2)
    CLB_GLOBAL_IN_MUX_EPWM3B_DB         = 47,  //!< EPWM3B DB submodule output (CLB1)
    CLB_GLOBAL_IN_MUX_EPWM7B_DB         = 47,  //!< EPWM7B DB submodule output (CLB2)

    CLB_GLOBAL_IN_MUX_EPWM4A            = 48,  //!< EPWM4A
    CLB_GLOBAL_IN_MUX_EPWM4A_OE         = 49,  //!< EPWM4A trip output
    CLB_GLOBAL_IN_MUX_EPWM4B            = 50,  //!< EPWM4B
    CLB_GLOBAL_IN_MUX_EPWM4B_OE         = 51,  //!< EPWM4B trip output
    CLB_GLOBAL_IN_MUX_EPWM4_CTR_ZERO    = 52,  //!< EPWM4 TBCTR = Zero
    CLB_GLOBAL_IN_MUX_EPWM4_CTR_PRD     = 53,  //!< EPWM4 TBCTR = TBPRD
    CLB_GLOBAL_IN_MUX_EPWM4_CTRDIR      = 54,  //!< EPWM4 CTRDIR
    CLB_GLOBAL_IN_MUX_EPWM4_TBCLK       = 55,  //!< EPWM4 TBCLK
    CLB_GLOBAL_IN_MUX_EPWM4_CTR_CMPA    = 56,  //!< EPWM4 TBCTR = CMPA
    CLB_GLOBAL_IN_MUX_EPWM4_CTR_CMPB    = 57,  //!< EPWM4 TBCTR = CMPB
    CLB_GLOBAL_IN_MUX_EPWM4_CTR_CMPC    = 58,  //!< EPWM4 TBCTR = CMPC
    CLB_GLOBAL_IN_MUX_EPWM4_CTR_CMPD    = 59,  //!< EPWM4 TBCTR = CMPD
    CLB_GLOBAL_IN_MUX_EPWM4A_AQ         = 60,  //!< EPWM4A AQ submodule output
    CLB_GLOBAL_IN_MUX_EPWM4B_AQ         = 61,  //!< EPWM4B AQ submodule output
    CLB_GLOBAL_IN_MUX_EPWM4A_DB         = 62,  //!< EPWM4A DB submodule output
    CLB_GLOBAL_IN_MUX_EPWM4B_DB         = 63,  //!< EPWM4B DB submodule output

    CLB_GLOBAL_IN_MUX_CLB_AUXSIG0       = 64,  //!< CLB X-BAR AUXSIG0
    CLB_GLOBAL_IN_MUX_CLB_AUXSIG1       = 65,  //!< CLB X-BAR AUXSIG1
    CLB_GLOBAL_IN_MUX_CLB_AUXSIG2       = 66,  //!< CLB X-BAR AUXSIG2
    CLB_GLOBAL_IN_MUX_CLB_AUXSIG3       = 67,  //!< CLB X-BAR AUXSIG3
    CLB_GLOBAL_IN_MUX_CLB_AUXSIG4       = 68,  //!< CLB X-BAR AUXSIG4
    CLB_GLOBAL_IN_MUX_CLB_AUXSIG5       = 69,  //!< CLB X-BAR AUXSIG5
    CLB_GLOBAL_IN_MUX_CLB_AUXSIG6       = 70,  //!< CLB X-BAR AUXSIG6
    CLB_GLOBAL_IN_MUX_CLB_AUXSIG7       = 71,  //!< CLB X-BAR AUXSIG7

    CLB_GLOBAL_IN_MUX_CLB1_OUT16         = 72,  //!< CLB1 OUT16
    CLB_GLOBAL_IN_MUX_CLB1_OUT17         = 73,  //!< CLB1 OUT17
    CLB_GLOBAL_IN_MUX_CLB1_OUT18         = 74,  //!< CLB1 OUT18
    CLB_GLOBAL_IN_MUX_CLB1_OUT19         = 75,  //!< CLB1 OUT19
    CLB_GLOBAL_IN_MUX_CLB1_OUT20         = 76,  //!< CLB1 OUT20
    CLB_GLOBAL_IN_MUX_CLB1_OUT21         = 77,  //!< CLB1 OUT21
    CLB_GLOBAL_IN_MUX_CLB1_OUT22         = 78,  //!< CLB1 OUT22
    CLB_GLOBAL_IN_MUX_CLB1_OUT23         = 79,  //!< CLB1 OUT23

    CLB_GLOBAL_IN_MUX_CLB2_OUT16         = 80,  //!< CLB2 OUT16
    CLB_GLOBAL_IN_MUX_CLB2_OUT17         = 81,  //!< CLB2 OUT17
    CLB_GLOBAL_IN_MUX_CLB2_OUT18         = 82,  //!< CLB2 OUT18
    CLB_GLOBAL_IN_MUX_CLB2_OUT19         = 83,  //!< CLB2 OUT19
    CLB_GLOBAL_IN_MUX_CLB2_OUT20         = 84,  //!< CLB2 OUT20
    CLB_GLOBAL_IN_MUX_CLB2_OUT21         = 85,  //!< CLB2 OUT21
    CLB_GLOBAL_IN_MUX_CLB2_OUT22         = 86,  //!< CLB2 OUT22
    CLB_GLOBAL_IN_MUX_CLB2_OUT23         = 87,  //!< CLB2 OUT23

    CLB_GLOBAL_IN_MUX_EPWM5A            = 88,  //!< EPWM5A
    CLB_GLOBAL_IN_MUX_EPWM5A_OE         = 89,  //!< EPWM5A trip output
    CLB_GLOBAL_IN_MUX_EPWM5B            = 90,  //!< EPWM5B
    CLB_GLOBAL_IN_MUX_EPWM5B_OE         = 91,  //!< EPWM5B trip output
    CLB_GLOBAL_IN_MUX_EPWM5_CTR_ZERO    = 92,  //!< EPWM5 TBCTR = Zero
    CLB_GLOBAL_IN_MUX_EPWM5_CTR_PRD     = 93,  //!< EPWM5 TBCTR = TBPRD
    CLB_GLOBAL_IN_MUX_EPWM5_CTRDIR      = 94,  //!< EPWM5 CTRDIR
    CLB_GLOBAL_IN_MUX_EPWM5_TBCLK       = 95,  //!< EPWM5 TBCLK
    CLB_GLOBAL_IN_MUX_EPWM5_CTR_CMPA    = 96,  //!< EPWM5 TBCTR = CMPA
    CLB_GLOBAL_IN_MUX_EPWM5_CTR_CMPB    = 97,  //!< EPWM5 TBCTR = CMPB
    CLB_GLOBAL_IN_MUX_EPWM5_CTR_CMPC    = 98,  //!< EPWM5 TBCTR = CMPC
    CLB_GLOBAL_IN_MUX_EPWM5_CTR_CMPD    = 99,  //!< EPWM5 TBCTR = CMPD
    CLB_GLOBAL_IN_MUX_EPWM5A_AQ         = 100, //!< EPWM5A AQ submodule output
    CLB_GLOBAL_IN_MUX_EPWM5B_AQ         = 101, //!< EPWM5B AQ submodule output
    CLB_GLOBAL_IN_MUX_EPWM5A_DB         = 102, //!< EPWM5A DB submodule output
    CLB_GLOBAL_IN_MUX_EPWM5B_DB         = 103, //!< EPWM5B DB submodule output

    CLB_GLOBAL_IN_MUX_ERAD_EVENT0       = 104,  //!< ERAD Event 0
    CLB_GLOBAL_IN_MUX_ERAD_EVENT1       = 105,  //!< ERAD Event 1
    CLB_GLOBAL_IN_MUX_ERAD_EVENT2       = 106,  //!< ERAD Event 2
    CLB_GLOBAL_IN_MUX_ERAD_EVENT3       = 107,  //!< ERAD Event 3
    CLB_GLOBAL_IN_MUX_ERAD_EVENT4       = 108,  //!< ERAD Event 4
    CLB_GLOBAL_IN_MUX_ERAD_EVENT5       = 109,  //!< ERAD Event 5
    CLB_GLOBAL_IN_MUX_ERAD_EVENT6       = 110,  //!< ERAD Event 6
    CLB_GLOBAL_IN_MUX_ERAD_EVENT7       = 111,  //!< ERAD Event 7

    CLB_GLOBAL_IN_MUX_FSIRXA_PING_TAG_MATCH    = 112,  //!< FSIRXA PING TAG Match
    CLB_GLOBAL_IN_MUX_FSIRXA_DATA_TAG_MATCH    = 113,  //!< FSIRXA DATA TAG Match
    CLB_GLOBAL_IN_MUX_FSIRXA_ERROR_TAG_MATCH   = 114,  //!< FSIRXA ERROR TAG Match

    CLB_GLOBAL_IN_MUX_FSIRXA_OUTPUT_FRAME_DONE = 115,  //!< FSIRXA Output Frame Done (CLB1)
    CLB_GLOBAL_IN_MUX_ECAP3_ECAPIN             = 115, //!< ECAP3 ECAPIN (CLB2)
    CLB_GLOBAL_IN_MUX_FSIRXA_DATA_PACKET_RCVD  = 116, //!< FSIRXA Data Packet Received (CLB1)
    CLB_GLOBAL_IN_MUX_ECAP3_ECAP_OUT           = 116, //!< ECAP3 ECAP_OUT (CLB2)
    CLB_GLOBAL_IN_MUX_FSIRXA_ERROR_PACKET_RCVD = 117, //!< FSIRXA Error Packet Received (CLB1)
    CLB_GLOBAL_IN_MUX_ECAP3_ECAP_OUT_EN        = 117, //!< ECAP3 ECAP_OUT_EN (CLB2)
    CLB_GLOBAL_IN_MUX_FSIRXA_PING_PACKET_RCVD  = 118, //!< FSIRXA PING Packet Received (CLB1)
    CLB_GLOBAL_IN_MUX_ECAP3_CEVT1              = 118, //!< ECAP3 CEVT1 (CLB2)
    CLB_GLOBAL_IN_MUX_FSIRXA_PACKET_TAG3       = 119, //!< FSIRXA Packet TAG3 (CLB1)
    CLB_GLOBAL_IN_MUX_ECAP3_CEVT2              = 119, //!< ECAP3 CEVT2 (CLB2)
    CLB_GLOBAL_IN_MUX_SPI1_SPICLK              = 120, //!< SPI1 SPICLK OUT (CLB1)
    CLB_GLOBAL_IN_MUX_ECAP3_CEVT3              = 120, //!< ECAP3 CEVT3 (CLB2)
    CLB_GLOBAL_IN_MUX_SPI1_SPIPOCI_CONTROLLER  = 121, //!< SPI1 SPIPOCI Controller IN (CLB1)
    CLB_GLOBAL_IN_MUX_ECAP3_CEVT4              = 121, //!< ECAP3 CEVT4 (CLB2)
    CLB_GLOBAL_IN_MUX_SPI1_SPIPTE              = 122, //!< SPI1 SPIPTE OUT (CLB1)
    CLB_GLOBAL_IN_MUX_EPWM5_OST                = 122, //!< EPWM5 OST (CLB2)
    CLB_GLOBAL_IN_MUX_SPI2_SPICLK              = 123, //!< SPI2 SPICLK OUT (CLB1)
    CLB_GLOBAL_IN_MUX_EPWM5_CBC                = 123, //!< EPWM5 CBC (CLB2)
    CLB_GLOBAL_IN_MUX_SPI2_SPIPOCI_CONTROLLER  = 124, //!< SPI2 SPIPOCI Controller IN (CLB1)
    CLB_GLOBAL_IN_MUX_EPWM6_OST                = 124, //!< EPWM6 OST (CLB2)
    CLB_GLOBAL_IN_MUX_SPI2_SPIPTE              = 125, //!< SPI2 SPIPTE OUT (CLB1)
    CLB_GLOBAL_IN_MUX_EPWm6_CBC                = 125, //!< EPWM6 CBC (CLB2)
    CLB_GLOBAL_IN_MUX_EPWM5_DCBH               = 126, //!< EPWM5 DCBH (CLB1)
    CLB_GLOBAL_IN_MUX_EPWM6_DCBH               = 126, //!< EPWM6 DCBH (CLB2)
    CLB_GLOBAL_IN_MUX_EPWM5_DCBL               = 127, //!< EPWM5 DCBL (CLB1)
    CLB_GLOBAL_IN_MUX_EPWM6_DCBL               = 127, //!< EPWM6 DCBL (CLB2)
} CLB_GlobalInputMux;

//*****************************************************************************
//
// Prototypes for the APIs.
//
//*****************************************************************************
//
//!
//! Checks the CLB base address.
//!
//! \param base is the base address of a CLB tile's logic config register.
//!
//! This function determines if a CLB base address is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static inline bool CLB_isBaseValid(uint32_t base)
{
    return(
           (base == CLB1_BASE) ||
           (base == CLB2_BASE)
          );
}

//*****************************************************************************
//
//!
//! Checks the CLB internal memory address.
//!
//! \param base is the base address of a CLB tile's logic config register.
//!
//! This function determines if a CLB base address is valid.
//!
//! \return Returns \b true if the address is valid and \b false otherwise.
//
//*****************************************************************************
static inline bool CLB_isAddressValid(uint32_t address)
{
    return(address <= (CLB_ADDR_HLC_BASE + CLB_NUM_HLC_INSTR));
}
#endif

//*****************************************************************************
//
//! Set global enable.
//!
//! \param base is the base address of a CLB tile's logic config register.
//!
//! This function enables the CLB via global enable register.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_enableCLB(uint32_t base)
{
    ASSERT(CLB_isBaseValid(base));

    EALLOW;
    HWREGH(base + CLB_LOGICCTL + CLB_O_LOAD_EN) |= CLB_LOAD_EN_GLOBAL_EN;
    EDIS;
}

//*****************************************************************************
//
//! Clear global enable.
//!
//! \param base is the base address of a CLB tile's logic config register.
//!
//! This function disables the CLB via global enable register.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_disableCLB(uint32_t base)
{
    ASSERT(CLB_isBaseValid(base));

    EALLOW;
    HWREGH(base + CLB_LOGICCTL + CLB_O_LOAD_EN) &= ~CLB_LOAD_EN_GLOBAL_EN;
    EDIS;
}

//*****************************************************************************
//
//! Enable HLC NMI.
//!
//! \param base is the base address of a CLB tile's logic config register.
//!
//! This function enables the CLB HLC NMI.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_enableNMI(uint32_t base)
{
    ASSERT(CLB_isBaseValid(base));

    EALLOW;
    HWREGH(base + CLB_LOGICCTL + CLB_O_LOAD_EN) |= CLB_LOAD_EN_NMI_EN;
    EDIS;
}

//*****************************************************************************
//
//! Disable HLC NMI.
//!
//! \param base is the base address of a CLB tile's logic config register.
//!
//! This function disables the CLB HLC NMI.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_disableNMI(uint32_t base)
{
    ASSERT(CLB_isBaseValid(base));

    EALLOW;
    HWREGH(base + CLB_LOGICCTL + CLB_O_LOAD_EN) &= ~CLB_LOAD_EN_NMI_EN;
    EDIS;
}

//*****************************************************************************
//
//! Configure Clock Prescalar.
//!
//! \param base is the base address of a CLB tile's logic config register.
//!
//! This function enables and configures the CLB Clock Precalar.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_configureClockPrescalar(uint32_t base, uint16_t prescl)
{
    ASSERT(CLB_isBaseValid(base));

    EALLOW;
    HWREG(base + CLB_LOGICCTL + CLB_O_PRESCALE_CTRL) =
        (HWREG(base + CLB_LOGICCTL + CLB_O_PRESCALE_CTRL) &
         ~(CLB_PRESCALE_CTRL_PRESCALE_M)) |
        ((uint32_t)prescl << CLB_PRESCALE_CTRL_PRESCALE_S);
    HWREG(base + CLB_LOGICCTL + CLB_O_PRESCALE_CTRL) |= CLB_PRESCALE_CTRL_CLKEN;
    EDIS;
}

//*****************************************************************************
//
//! Configures Clock Precalar Strobe Mode.
//!
//! \param base is the base address of a CLB tile's logic config register.
//!
//! This function enables and configures the CLB Clock Precalar Strobe Mode.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_configureStrobeMode(uint32_t base, uint16_t strb)
{
    ASSERT(CLB_isBaseValid(base));

    EALLOW;
    HWREG(base + CLB_LOGICCTL + CLB_O_PRESCALE_CTRL) =
        (HWREG(base + CLB_LOGICCTL + CLB_O_PRESCALE_CTRL) &
         ~((uint32_t)CLB_PRESCALE_CTRL_TAP_M)) |
        ((uint32_t)strb << CLB_PRESCALE_CTRL_TAP_S);
    HWREG(base + CLB_LOGICCTL + CLB_O_PRESCALE_CTRL) |= CLB_PRESCALE_CTRL_STRB;
    EDIS;
}

//*****************************************************************************
//
//! Configures the general purpose SW release control value.
//!
//! \param base is the base address of a CLB tile's logic config register.
//! \param inID is the specified CLB SW Release input signal.
//! \param val is the value of the SW RLS control.
//!
//! This function configures the general purpose SW release control value.
//! The \e inID parameter can have one enumeration value from CLB_SWReleaseCtrl.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_writeSWReleaseControl(uint32_t base,
                                            CLB_SWReleaseCtrl inID, bool val)
{
    ASSERT(CLB_isBaseValid(base));


    HWREG(base + CLB_LOGICCTL + CLB_O_GP_REG) =
            (HWREG(base + CLB_LOGICCTL + CLB_O_GP_REG) &
                ~(0x1000000U << inID)) |
                    (((uint32_t)val) << (24U + inID));
}


//*****************************************************************************
//
//! Configures the general purpose SW gate control value.
//!
//! \param base is the base address of a CLB tile's logic config register.
//! \param inID is the specified CLB SW Release input signal.
//! \param val is the value of the SW GATE control.
//!
//! This function configures the general purpose SW release control value.
//! The \e inID parameter can have one enumeration value from CLB_SWGateCtrl.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_writeSWGateControl(uint32_t base,
                                            CLB_SWGateCtrl inID, bool val)
{
    ASSERT(CLB_isBaseValid(base));

    HWREG(base + CLB_LOGICCTL + CLB_O_GP_REG) =
            (HWREG(base + CLB_LOGICCTL + CLB_O_GP_REG) &
                ~(0x10000U << inID)) |
                    (((uint32_t)val) << (16U + inID));

